tutorials/myLusgsFoam/ercoftacCentrifugalPump_MRF/0/k
/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform   1;

boundaryField
{
    INLET
    {
      type            turbulentIntensityKineticEnergyInlet;
      intensity 0.05;
      value           $internalField;
    }
    OUTLET
    {
        type            inletOutlet;
	inletValue $internalField;
	value $internalField;	
    }
    BLADE_ROT
    {
        type            kqRWallFunction;
      value           $internalField;
    }
    BLADE_STAT
    {
        type            kqRWallFunction;
      value           $internalField;
    }
    STATOR
    {
        type            empty;
    }
    AMI_INT
    {
        type            cyclicAMI;
    }   
    AMI_EXT
    {
        type            cyclicAMI;
    }   
    HUB_SHROUD
    {
        type            empty;
    }
}

// ************************************************************************* //
